Добрый день!
Перепроверили по следующему алгоритму:
1. Взяли предыдущий манифест, выполнили terraform apply
2. Изменили параметр ресурса sbercloud_compute_interface_attach
3. Выполнили terraform plan, результаты ниже:

```terraform
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sbercloud_compute_interface_attach.test must be replaced
-/+ resource "sbercloud_compute_interface_attach" "test" {
      ~ fixed_ip           = "192.168.10.29" -> (known after apply)
      + fixed_ipv6         = (known after apply)
      ~ id                 = "xxx" -> (known after apply)
      ~ ipv6_enable        = false -> (known after apply)
      ~ mac                = "fa:16:3e:94:f6:09" -> (known after apply)
      ~ network_id         = "xxx" -> "yyy" # forces replacement
      ~ port_id            = "xxx" -> (known after apply)
      ~ region             = "ru-moscow-1" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

``` 

terraform plan отработал без ошибок, в логе есть get запрос, аналогичный приведённому вами:


```terraform
2025-01-30T09:52:18.707+0300 [INFO]  provider.terraform-provider-sbercloud_v1.12.6: 2025/01/30 09:52:18 [DEBUG] [1738219938607-62] API Request URL: GET https://vpc.ru-moscow-1.hc.sbercloud.ru/v1/74d54d86709c4e02adfdb36abdbcb21e/ports/62e2dedb-e628-4f79-84ff-a1539fb415f1
API Request Headers:
Accept: application/json
Authorization: ***
User-Agent: terraform-provider-iac golangsdk/2.0.0
X-Project-Id: 74d54d86709c4e02adfdb36abdbcb21e
X-Sdk-Date: 20250130T065218Z: timestamp=2025-01-30T09:52:18.707+0300
2025-01-30T09:52:18.707+0300 [INFO]  provider.terraform-provider-sbercloud_v1.12.6: 2025/01/30 09:52:18 [DEBUG] [1738219938607-62] API Response Code: 200
``` 

По нему не возвращается ошибка. Также, без ошибок выполняется команда terraform apply. Получается, что при работе с уже созданными ресурсами проблем не возникает.
Перепроверьте пожалуйста на версии провайдера 1.12.6